Buffer bug solved
